---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Schema.ListSchemas
source: html/0f49289a-ca96-089e-a1c2-6f5bf80e29eb.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.ListSchemas Method

Lists all schemas in memory.

## Syntax (C#)
```csharp
public static IList<Schema> ListSchemas()
```